src/cf/DataProcessors/РаботаСРезультатамиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РаботаСРезультатамиОбмена</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВРегистрОбъектыКЗагрузке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбрабатываемойВерсии</Name>
					<Comment>Соответствует дате добавления в РС "Прочитанные данные сообщений обмена". Если отличается, то были прочитаны новые данные</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСконвертированногоОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбновленияОбъектаВИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбновленияОбъектаПриПроблемахЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСсылкаНаОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаФорматаЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПрочитанныеДанныеСообщенийОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрочитанныеДанныеСообщенийОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбъектаВИсточнике</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СодержимоеЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПространствоИменURI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛокальноеИмяОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КоличествоБлокируемыхОбъектовКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КоличествоБлокируемыхОбъектовКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПричиныДобавленияВРегистрОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныДобавленияВРегистрОбъектыКЗагрузке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетЗагрузкуДругихОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПолучениеЭтогоОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПоискСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКонвертации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроверкиПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоНаКонвертацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКЗагрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОтклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусыОбновленияОбъектаПриПроблемахЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбновленияОбъектаПриПроблемахЗаписи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗагруженСозданНовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗагруженНеСоздан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженОбновлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗагруженНеОбновлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/РаботаСРезультатамиОбмена/Forms/ВыборПроблемыПослеЗагрузки/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНовыеПроблемы

&НаКлиенте
Процедура НовыеПроблемыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборПроблемы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОбработатьВыборПроблемы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияФормы

&НаСервере
Процедура ОбработатьПереданныеПараметры(Отказ)
	
	Если ТипЗнч(Параметры.ДанныеЗагрузки) <> Тип("Массив")
		Или Параметры.ДанныеЗагрузки.Количество() = 0 Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	УзелПланаОбмена = Параметры.УзелПланаОбмена;
	ЗаполнитьДанныеФормы(Параметры.ДанныеЗагрузки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы(ДанныеЗагрузки)

	ТаблицаДанныхЗагрузки = Новый ТаблицаЗначений;
	ТаблицаДанныхЗагрузки.Колонки.Добавить("ПолученныйОбъект",   ОбщегоНазначения.ОписаниеТипаСтрока(40));
	ТаблицаДанныхЗагрузки.Колонки.Добавить("ПравилоКонвертации", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаДанныхЗагрузки.Колонки.Добавить("ОбъектФормата",      ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаДанныхЗагрузки.Колонки.Добавить("УзелПланаОбмена",    РаботаСРезультатамиОбмена.ОписаниеТипаПланыОбменаБСП());
	
	Для Каждого ДанныеОбъекта Из ДанныеЗагрузки Цикл
		
		НоваяСтрока = ТаблицаДанныхЗагрузки.Добавить();
		НоваяСтрока.ПолученныйОбъект   = ДанныеОбъекта.ПолученныйОбъект;
		НоваяСтрока.ПравилоКонвертации = ДанныеОбъекта.ПравилоКонвертации;
		НоваяСтрока.ПравилоКонвертации = ДанныеОбъекта.УзелПланаОбмена;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДанныхЗагрузки.ПолученныйОбъект   КАК ПолученныйОбъект,
	|	ТаблицаДанныхЗагрузки.ПравилоКонвертации КАК ПравилоКонвертации,
	|	ТаблицаДанныхЗагрузки.ОбъектФормата      КАК ОбъектФормата,
	|	ТаблицаДанныхЗагрузки.УзелПланаОбмена    КАК УзелПланаОбмена
	|ПОМЕСТИТЬ ТаблицаДанныхЗагрузки
	|ИЗ
	|	&ТаблицаДанныхЗагрузки КАК ТаблицаДанныхЗагрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныхЗагрузки.ПолученныйОбъект         КАК ПолученныйОбъект,
	|	ТаблицаДанныхЗагрузки.ПравилоКонвертации       КАК ПравилоКонвертации,
	|	ТаблицаДанныхЗагрузки.ОбъектФормата            КАК ОбъектФормата,
	|	ТаблицаДанныхЗагрузки.УзелПланаОбмена          КАК УзелПланаОбмена,
	|	ВЫБОР
	|		КОГДА ОбъектыКЗагрузке.ОбъектМетаданных = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)
	|		ТОГДА ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата
	|	ИНАЧЕ ОбъектыКЗагрузке.ОбъектМетаданных
	|	КОНЕЦ                                          КАК ТипОбъекта,
	|	ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ    КАК СтатусОбновленияОбъектаВИБ,
	|	ВЫБОР
	|		КОГДА ОбъектыКЗагрузке.ПричинаДобавления В (ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения))
	|			И (ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ = ЗНАЧЕНИЕ(Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженСозданНовый)
	|			ИЛИ ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ = ЗНАЧЕНИЕ(Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженОбновлен))
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи)
	|		КОГДА ОбъектыКЗагрузке.ПричинаДобавления В (ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения))
	|			И (ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ = ЗНАЧЕНИЕ(Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеСоздан)
	|			ИЛИ ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ = ЗНАЧЕНИЕ(Перечисление.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен))
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи)
	|		ИНАЧЕ ОбъектыКЗагрузке.ПричинаДобавления
	|	КОНЕЦ                                             КАК ТипПроблемы,
	|	ОбъектыКЗагрузке.СсылкаНаОбъект                   КАК СоответствиеВИБ,
	|	ПрочитанныеДанныеСообщенийОбмена.ДатаДобавления   КАК ДатаПолученияДанных,
	|	ОбъектыКЗагрузке.ДатаУстановкиПричиныДобавления   КАК ДатаВозникновения,
	|	ОбъектыКЗагрузке.ВнешняяСсылкаНаОбъект            КАК ВнешняяСсылкаНаОбъект,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(150))                    КАК ПредставлениеОбъекта,
	|	ОбъектыКЗагрузке.ДанныеСконвертированногоОбъекта  КАК ДанныеСконвертированногоОбъекта,
	|	КоличествоБлокируемыхОбъектовКЗагрузке.Количество КАК КоличествоБлокирует,
	|	ВЫБОР
	|		КОГДА ИдентификаторыОбъектовМетаданных.ПорядокКоллекции ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ИдентификаторыОбъектовМетаданных.ПорядокКоллекции = 4
	|			ТОГДА 4
	|		КОГДА ИдентификаторыОбъектовМетаданных.ПорядокКоллекции = 5
	|			ТОГДА 8
	|		ИНАЧЕ 0
	|	КОНЕЦ                                             КАК ИдентификаторКартинки
	|ИЗ
	|	ТаблицаДанныхЗагрузки КАК ТаблицаДанныхЗагрузки 
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|	ПО ОбъектыКЗагрузке.ПолученныйОбъект      = ТаблицаДанныхЗагрузки.ПолученныйОбъект
	|		И ОбъектыКЗагрузке.ПравилоКонвертации = ТаблицаДанныхЗагрузки.ПравилоКонвертации
	|		И ОбъектыКЗагрузке.ОбъектФормата      = ТаблицаДанныхЗагрузки.ОбъектФормата
	|		И ОбъектыКЗагрузке.УзелПланаОбмена    = ТаблицаДанныхЗагрузки.УзелПланаОбмена
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|	ПО ОбъектыКЗагрузке.ПолученныйОбъект = ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект
	|		И ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена = ОбъектыКЗагрузке.УзелПланаОбмена
	|		И ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата   = ОбъектыКЗагрузке.ОбъектФормата
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных 
	|		ПО ОбъектыКЗагрузке.ОбъектМетаданных = ИдентификаторыОбъектовМетаданных.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоБлокируемыхОбъектовКЗагрузке КАК КоличествоБлокируемыхОбъектовКЗагрузке
	|	ПО ОбъектыКЗагрузке.ПолученныйОбъект = КоличествоБлокируемыхОбъектовКЗагрузке.ОбъектКПолучению
	|	И ОбъектыКЗагрузке.ОбъектФормата     = КоличествоБлокируемыхОбъектовКЗагрузке.ОбъектФормата
	|	И ОбъектыКЗагрузке.УзелПланаОбмена = КоличествоБлокируемыхОбъектовКЗагрузке.УзелПланаОбмена
	|ГДЕ
	|	ОбъектыКЗагрузке.ПричинаДобавления В (ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов), ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта))
	|";
	
	Запрос.УстановитьПараметр("ТаблицаДанныхЗагрузки", ТаблицаДанныхЗагрузки);
	Запрос.УстановитьПараметр("УзелПланаОбмена",       УзелПланаОбмена);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		НоваяСтрока = НовыеПричины.Добавить(); 
		
		НоваяСтрока.ПолученныйОбъект           = Выборка.ПолученныйОбъект;
		НоваяСтрока.ПравилоКонвертации         = Выборка.ПравилоКонвертации;
		НоваяСтрока.ТипПроблемы                = Выборка.ТипПроблемы;
		НоваяСтрока.ТипОбъекта                 = Выборка.ТипОбъекта;
		НоваяСтрока.ОбъектФормата              = Выборка.ОбъектФормата;
		НоваяСтрока.СоответствиеВИБ            = Выборка.СоответствиеВИБ;
		НоваяСтрока.СтатусОбновленияОбъектаВИБ = Выборка.СтатусОбновленияОбъектаВИБ;
		НоваяСтрока.КоличествоБлокирует        = Выборка.КоличествоБлокирует;
		НоваяСтрока.ИдентификаторКартинки      = Выборка.ИдентификаторКартинки;
		
		ДанныеJSONСконвертированногоОбъекта = Выборка.ДанныеСконвертированногоОбъекта.Получить();
		
		Если ДанныеJSONСконвертированногоОбъекта <> Неопределено Тогда
			НоваяСтрока.ПредставлениеОбъекта = Строка(РаботаСРезультатамиОбмена.ДанныеОбъектаИзJSON(ДанныеJSONСконвертированногоОбъекта));
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборПроблемы()

	ТекущиеДанные = Элементы.НовыеПроблемы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаписи = РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке();
	ДанныеЗаписи.ПолученныйОбъект   = ТекущиеДанные.ПолученныйОбъект;
	ДанныеЗаписи.ПравилоКонвертации = ТекущиеДанные.ПравилоКонвертации;
	ДанныеЗаписи.ОбъектФормата      = ТекущиеДанные.ОбъектФормата;
	ДанныеЗаписи.УзелПланаОбмена    = УзелПланаОбмена;
	
	ПричинаДобавления = РаботаСРезультатамиОбменаКлиентСервер.ПричинаДобавленияИлиСтатусОбновленияВИБ(
	                                                          ТекущиеДанные.ТипПроблемы,
	                                                          ТекущиеДанные.СтатусОбновленияОбъектаВИБ);
	
	// @skip-warning обработчик оповещения находится в другой форме.
	ОповещениеОЗакрытииФормыПроблемы = Новый ОписаниеОповещения("ПослеЗакрытияФормыПроблемы", ВладелецФормы);
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуПроблемы(
		ДанныеЗаписи, ВладелецФормы, ПричинаДобавления, ОповещениеОЗакрытииФормыПроблемы);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
